app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
    @comments = @article.comments
    @article.view_times = @article.view_times+1
    @article.save
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2011-05-19 15:53:12', "view_times" = 1 WHERE "id" = 1

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    #render :text=>params[:tags].inspect
    #render :text=>tags_object(params[:tags])[0].name
    @article = Article.new(params[:article])
    @article.tags = tags_object(params[:tags])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "updated_at", "view_times", "category_id", "content") VALUES('2011-05-20 05:06:17', 'category test', '2011-05-20 05:06:17', 0, 1, 'this is a category test')
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES('ji', '2011-05-22 06:18:36', '2011-05-22 06:18:36')

  def update
    @article = Article.find(params[:id])
    @article.tags = tags_object(params[:tags])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)
UPDATE "articles" SET "updated_at" = '2011-05-19 14:07:22', "content" = 'this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page this is another test page ' WHERE "id" = 2

  def add_comment
    @comment = Comment.new(params[:comment])
    if @comment.save
---
INSERT INTO "comments" ("name", "created_at", "updated_at", "article_id", "content", "email") VALUES('jumping', '2011-05-19 14:05:58', '2011-05-19 14:05:58', 2, 'another comment just a testanother comment just a testanother comment just a testanother comment just a test

  def show_same_category
    @articles = Category.find(params[:id]).articles
---
SELECT * FROM "articles" WHERE ("articles".category_id = 1)
SELECT * FROM "categories" WHERE ("categories"."id" = 1)