app/controllers/category_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 2)
UPDATE "categories" SET "updated_at" = '2011-05-20 11:29:51', "name" = '一些扯淡' WHERE "id" = 3
---
  def edit
    @category = Category.find(params[:id])
    if request.post?
      @category.name = params[:category]['name']
      @category.save

DELETE FROM "categories" WHERE "id" = 7
SELECT * FROM "categories" WHERE ("categories"."id" = 7)
---
  def delete
    Category.find(params[:id]).destroy

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('test', '2011-05-20 07:17:12', '2011-05-20 07:17:12')
---
  def add
    @category = Category.new

    if request.post?
      @category.name=params[:category]['name']
      @category.save