app/controllers/tags_controller.rb

SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def show
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES('rails', '2011-05-21 15:40:21', '2011-05-21 15:40:21')
---
  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save

SELECT * FROM "articles" INNER JOIN "articles_tags" ON "articles".id = "articles_tags".article_id WHERE ("articles_tags".tag_id = 12 )
SELECT * FROM "tags" WHERE ("tags"."id" = 12)
---
  def search_by_tag
    flash[:tag]=params[:id]
    @articles = Tag.find(params[:id]).articles